# WrongDepthDimensionLabel Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarShapeFailures..::..WrongDepthDimensionLabel Property
BuiltInFailures..::..RebarShapeFailures Class See Also
---
Multi-planar depth dimension label is already used for one of the planar shape parameters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WrongDepthDimensionLabel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WrongDepthDimensionLabel As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WrongDepthDimensionLabel {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarShapeFailures Class
Autodesk.Revit.DB Namespace